actuator/AC-DBD-Decomp/flow/0/Fc3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Fc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -2 -2 0 0 0 0];

internalField   nonuniform List<vector> 
58002
(
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;

boundaryField
{
    upperBoundary
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    leftBoundary
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    rightBoundary
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    highVoltage
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    region0_to_dielectric
    {
        type            calculated;
        value           nonuniform List<vector> 
445
(
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
}


// ************************************************************************* //
